Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/J12.e.tmx
Source language: en_us
Languages: zh_cn

source: Chapter 4 Electric Fields in Matter
zh_cn: 第4章 物质中的电场

source: 4.1 Polarization
zh_cn: 4.1 极化

source: Dielectrics
zh_cn: 电介质

source: In this chapter we shall study electric fields in matter.
zh_cn: 在这一章中，我们将学习物质中的电场。

source: Matter, of course, comes in many varieties-solids, liquids, gases, metals, woods, glasses-and these substances do not all respond in the same way to electrostatic fields.
zh_cn: 当然，物质有许多种类——固态、液态、气态、金属、木材和玻璃——这些物质并不都以相同的方式来响应静电场的影响。

source: Nevertheless, most everyday objects belong (at least, in good approximation) to one of two large classes: conductors and insulators (or dielectrics).
zh_cn: 然而，大多数经常遇到的物质（至少在很好的近似下）属于两大类中的一种：导体和绝缘体（或者电介质）。

source: We have already talked about conductors; these are substances that contain an "unlimited" supply of charges that are free to move about through the material.
zh_cn: 我们已经讲到过导体；它们是可以“无限制”地提供在其内部可自由移动的电荷的一类物体。

source: In practice what this ordinarily means is that many of the electrons (one or two per atom in a typical metal) are not associated with any particular nucleus, but roam around at will.
zh_cn: 这种说法的实际含义是，许多电子（在普通的金属中每个原子提供一到两个电子）并不和任何特定的原子核关联，而是在导体中漫游。

source: In dielectrics, by contrast, all charges are attached to specific atoms or molecules - they're on a tight leash, and all they can do is move a bit within the atom or molecule.
zh_cn: 相比之下，在电介质中，所有的电荷都附属于特定的原子或分子一一它们被束缚着，所有的电子只能在原子或分子中移动一个小的位移。

source: Such microscopic displacements are not as dramatic as the wholesale rearrangement of charge in a conductor, but their cumulative effects account for the characteristic behavior of dielectric materials.
zh_cn: 如此微小的位移并不像在导体中电子的完全重新分布那样引人注目，但是它们的累积效应可以解释电介质材料的行为特性。

source: There are actually two principal mechanisms by which electric fields can distort the charge distribution of a dielectric atom or molecule: stretching and rotating.
zh_cn: 实际上，有两个主要的机制使得电场可以扭曲电介质原子或分子中的电荷分布：伸展和旋转。

source: In the next two sections I'll discuss these processes.
zh_cn: 在下面的两小节中，我将讨论这些过程。

source: Induced Dipoles
zh_cn: 诱导偶极子

source: What happens to a neutral atom when it is placed in an electric field E?
zh_cn: 当一个中性的原子放在一个电场中会发生什么？

source: Your first guess might well be: "Absolutely nothing - since the atom is not charged, the field has no effect on it."
zh_cn: 你的第一想法可能是：“没什么会发生——因为它不带电，电场对其不起作用”。

source: But that is incorrect.
zh_cn: 但这是不正确的。

source: Although the atom as a whole is electrically neutral, there is a positively charged core (the nucleus) and a negatively charged electron cloud surrounding it.
zh_cn: 尽管原子作为一个整体是电中性的，但是它是由一个带正电的原子核和在其周围分布的带负电的电子云构成的。

source: These two regions of charge within the atom are influenced by the field: the nucleus is pushed in the direction of the field, and the electrons the opposite way.
zh_cn: 在原子中这两个带电的部分是受外电场影响的：核的移动与电场方向相同，电子朝着相反方向。

source: In principle, if the field is large enough, it can pull the atom apart completely, "ionizing" it (the substance then becomes a conductor).
zh_cn: 原则上，如果电场足够大，它可以将原子完全分离开来，“电离”原子（物体则变成一个导体）。

source: With less extreme fields, however, an equilibrium is soon established, for if the center of the electron cloud does not coincide with the nucleus, these positive and negative charges attract one another, and this holds the atoms together.
zh_cn: 然而，当外电场较小时，一个平衡将很快建立，因为如果电子分布中心和核的中心不一致，正负电荷就会相互吸引，使得原子聚合在一起。

source: The two opposing forces-E pulling the electrons and nucleus apart, their mutual attraction drawing them together - reach a balance, leaving the atom polarized, with plus charge shifted slightly one way, and minus the other.
zh_cn: 两个相反的力——E使电子和原子核分离，它们之间的相互吸引——达到一个平衡，平衡时正电荷和负电荷有一个很小的移动，导致原子被极化。

source: The atom now has a tiny dipole moment p, which points in the same direction as E.
zh_cn: 原子现在有了一个微小的偶极矩P，它和电场E的方向相同。

source: Typically, this induced dipole moment is approximately proportional to the field (as long as the latter is not too strong):
zh_cn: 一般来讲，这个诱导的偶极矩和电场近似成正比（只要电场不是太强）：

source: The constant of proportionality . . . is called atomic polarizability.
zh_cn: 式中，比例常数. . .称为原子极化率。

source: Its value depends on the detailed structure of the atom in question.
zh_cn: 它的大小依赖于具体问题中的原子结构。

source: Table 4.1 lists some experimentally determined atomic polarizabilities.
zh_cn: 表4.1列出了一些实验测得的原子极化率。

source: Example 4.1
zh_cn: 例题4.1

source: A primitive model for an atom consists of a point nucleus (+q surrounded by a uniformly charged spherical cloud (-q) of radius a (Fig. 4.1).
zh_cn: 一个简单的原子模型由带+q电荷量的原子核和围绕它的均匀带-q的半径为a的球形电子云组成（见图4.1）。

source: Calculate the atomic polarizability of such an atom.
zh_cn: 计算这样一个原子的极化率。

source: Solution: In the presence of an external field E, the nucleus will be shifted slightly to the right and the electron cloud to the left, as shown in Fig. 4.2.
zh_cn: 解：在外电场E中，原子核将向右偏离，电子云向左偏离，如图4.2所示。

source: (Because the actual displacements involved are extremely small, as you'll see in Prob. 4.1, it is reasonable to assume that the electron cloud retains its spherical shape.)
zh_cn: （因为实际位移是极其微小的（见习题4.1），可以合理地认为电子云依然保持球状。）

source: Say that equilibrium occurs when the nucleus is displaced a distance d from the center of the sphere.
zh_cn: 这样，当原子核从球中心移动一个距离d时达到平衡。

source: At that point the external field pushing the nucleus to the right exactly balances the internal field pulling it to the left: E = Ee, where Ee is the field produced by the electron cloud.
zh_cn: 此时，外电场将原子核向右推的力与内电场将原子核向左拉的力平衡：E=Ee，其中Ee为电子云产生的电场。

source: Now the field at a distance d from the center of a uniformly charged sphere is . . . (Prob. 2.12).
zh_cn: 一个均匀的球形分布电荷在距离球心为d处产生的电场为 . . .（习题2.12）。

source: At equilibrium, then, . . .
zh_cn: 在平衡时，有. . .

source: The atomic polarizability is therefore . . ., (4.2)
zh_cn: 因此，原子极化率为. . .（4.2）

source: where v is the volume of the atom.
zh_cn: 式中，v是原子体积。

source: Although this atomic model is extremely crude, the result (4.2) is not too bad - it's accurate to within a factor of four or so for many simple atoms.
zh_cn: 尽管这种原子模型十分简略，但是结果式（4.2）并不是太糟——对许多简单原子它可精确到万分之一以上。

source: For molecules the situation is not quite so simple, because frequently they polarize more readily in some directions than others.
zh_cn: 对于分子情况就不是那么简单了，因为它们常常沿某个方向更容易极化。

source: Carbon dioxide (Fig. 4.3), for instance, has a polarizability of . . .m/N when you apply the field along the axis of the molecule, but only . . . for fields perpendicular to this direction.
zh_cn: 例如，对二氧化碳（见图4.3），当外电场方向沿着分子轴向时，极化率为. . .·m/N，而当外电场方向垂直于分子轴时，极化率为. . .·m/N。

source: When the field is at some angle to the axis, you must resolve it into parallel and perpendicular components, and multiply each by the pertinent polarizability:
zh_cn: 当外电场与分子轴有一个角度时，你必须将电场分解为平行分量和垂直分量来解决，并乘上相应的极化率：

source: In this case the induced dipole moment may not even be in the same direction as E.
zh_cn: 在这种情况下，感应偶极矩可以和电场E的方向不一致。

source: And CO2 is relatively simple, as molecules go, since the atoms at least arrange themselves in a straight line; for a completely asymmetrical molecule Eq. 4.1 is replaced by the most general linear relation between E and p: . . . (4.3)
zh_cn: 与其他分子相比，CO2还是比较简单的，因为它的原子至少还排列为一条直线；对于完全非对称的分子式（4.1）将被更普遍的E和p的线性关系代替：. . .（4.3）

source: The set of nine constants . . ., constitute the polarizability tensor for the molecule.
zh_cn: 这九个常数. . .组成了分子的极化张量。

source: Their actual values depend on the orientation of the axes you chose, though it is always possible to choose "principal" axes such that all the off-diagonal terms ( . . . , . . . , etc.) vanish, leaving just three nonzero polarizabilities: . . . , . . . , and . . . .
zh_cn: 它们实际的值依赖于你所选取的坐标轴的方向，尽管通常总是可以选取“主”轴，使得非对角元（. . .，. . .）为零，仅余三个非零的：. . .，. . .，. . .。

source: Problem 4.1
zh_cn: 习题4.1

source: A hydrogen atom (with the Bohr radius of half an angstrom) is situated between two metal plates 1 mm apart, which are connected to opposite terminals of a 500 V battery.
zh_cn: 一个氢原子（其玻尔半径为0.5A）位于两个相距1mm的金属板中间，金属板连接在500V的电池上。

source: What fraction of the atomic radius does the separation distance d amount to, roughly?
zh_cn: 粗略地估计分离距离d与玻尔半径的比为多少？

source: Estimate the voltage you would need with this apparatus to ionize the atom.
zh_cn: 估计在这个装置中电离原子所需的电压为多少。

source: [Use the value of . . . in Table 4.1.
zh_cn: ［利用表4.1中提供的. . .值。

source: Moral: The displacements we're talking about are minute, even on an atomic scale.]
zh_cn: 原则上，这里所谈及的距离是十分微小的，即使是在原子尺寸上。］

source: Problem 4.2
zh_cn: 习题4.2

source: According to quantum mechanics, the electron cloud for a hydrogen atom in the ground state has a charge density. . . .,
zh_cn: 根据量子力学，对于基态氢原子电子云其电荷密度为 . . .

source: where q is the charge of the electron and a is the Bohr radius.
zh_cn: 式中，q是电子电荷，a为玻尔半径。

source: Find the atomic polarizability of such an atom.
zh_cn: 求出这样一个原子的极化率。

source: [Hint: First calculate the electric field of the electron cloud, Ee (r); then expand the exponential, assuming r << a.
zh_cn: ［提示：首先计算电子云的电场Ee（r）；然后假设r << a，将指数展开。

source: For a more sophisticated approach. see W. A. Bowers. Am. J. Phys. 54,347 (1986).]
zh_cn: 一个更详细的解答参见W.A.Bowers，Am.J.Phys.54，347（1986）。］

source: Problem 4.3
zh_cn: 习题4.3

source: According to Eq. 4.1, the induced dipole moment of an atom is proportional to the external field.
zh_cn: 根据式（4.1），原子的感应偶极矩是正比于外电场的。

source: This is a "rule of thumb," not a fundamental law, and it is easy to concoct exceptions - in theory.
zh_cn: 这是一个经验公式，并非基本定律，理论上它十分容易虚构例外。

source: Suppose, for example, the charge density of the electron cloud were proportional to the distance from the center, out to a radius R.
zh_cn: 例如，假设电子云的电荷密度正比于距中心的距离，直到半径R。

source: To what power of E would p be proportional in that case?
zh_cn: 近似到何种程度召和P成正比？

source: Find the condition on p(r) such that Eq. 4.1 will hold in the weak-field limit.
zh_cn: 找出p（r）满足的条件，使得式（4.1）在弱场极限下成立。

source: Problem 4.4
zh_cn: 习题4.4

source: A point charge q is situated a large distance r from a neutral atom of polarizability . . ..
zh_cn: 一个点电荷q放置在距离中性原子中心较大的距离r处，原子极化率为. . .。

source: Find the force of attraction between them.
zh_cn: 求出它们之间的吸引力。

source: 4.1.3 Alignment of Polar Molecules
zh_cn: 4.1.3 极化分子的排列

source: The neutral atom discussed in Sect. 4.1.2 had no dipole moment to start with-p was induced by the applied field.
zh_cn: 4.1.2小节中讨论的中性原子开始时没有偶极矩——p是由外电场诱导的。

source: Some molecules have built-in, permanent dipole moments.
zh_cn: 一些分子具有固有的永久偶极矩。

source: In the water molecule, for example, the electrons tend to cluster around the oxygen atom (Fig. 4.4), and since the molecule is bent at 105. . ., this leaves a negative charge at the vertex and a net positive charge at the opposite end.
zh_cn: 例如，在水分子中，电子趋向于环绕在氧原子周（见图4.4），由于分子呈105. . .角，这使得负电荷位于顶角处，而正电荷在相反的一端。

source: (The dipole moment of water is unusually large: 6.1×10-30C·m; in fact, this is what accounts for its effectiveness as a solvent.)
zh_cn: （水分子的偶极矩是不寻常地大：6.1×10-30C·m；事实上，这就是水为什么可以作为一个有效的溶剂。）

source: What happens when such molecules (called polar molecules) are placed in an electric field?
zh_cn: 如果将这样的分子（称为极化分子）放置在电场中会发生什么？

source: If the field is uniform, the force on the positive end, F+ = qE, exactly cancels the force on the negative end, F- = -qE (Fig. 4.5).
zh_cn: 如果是均匀电场，作用在正电荷上的力F+=qE，恰好和作用在负电荷上的力F-=-qE相互抵消（见图4.5）。

source: However, there will be a torque: . . ..
zh_cn: 不过将出现一个力矩：. . .

source: Thus a dipole p = qd in a uniform field E experiences a torque (4.4)
zh_cn: 因此，一个偶极子p=qd在一个均匀外电场E中受到一个力矩. . .（4.4）

source: Notice that N is in such a direction as to line p up parallel to E; a polar molecule that is free to rotate will swing around until it points in the direction of the applied field.
zh_cn: 注意，N的方向倾向于使p与E平行；一个可自由转动的极化分子的p将会转向外电场方向。

source: If the field is nonuniform, so that F+ does not exactly balance F-, there will be a net force on the dipole, in addition to the torque.
zh_cn: 如果电场是非均匀的，那么F+与F-就不会严格相抵，除了力矩外，还会出现一个作用在偶极子上的净力。

source: Of course, E must change rather abruptly for there to be significant variation in the space of one molecule, so this is not ordinarily a major consideration in discussing the behavior of dielectrics.
zh_cn: 当然，这需要E必须在分子的尺度上变化得相当显著，在讨论电介质行为时这通常不是一个要考虑的主要因素。

source: Nevertheless, the formula for the force on a dipole in a nonuniform field is of some interest: . . .
zh_cn: 然而，非均匀电场所产生的作用在偶极子上的力的公式还是有某些有趣之处的：. . .

source: where . . . represents the difference between the field at the plus end and the field at the minus end.
zh_cn: 式中，. . .代表电场在正负电荷处的差值。

source: Assuming the dipole is very short, we may use Eq. 1.35 to approximate the small change in Ex:
zh_cn: 假设，偶极子的长度是非常短的，我们可以利用式（1.35）对变化很小的电场Ex求近似：

source: with corresponding formulas for Ey and Ez.
zh_cn: 对于如Ey，Ex也有同样的形式。

source: More compactly, . . .
zh_cn: 更紧凑的有. . .

source: and therefore . . .(4.5)
zh_cn: 因此，. . .（4.5）

source: For a "perfect" dipole of infinitesimal length, Eq. 4.4 gives the torque about the center of the dipole even in a nonuniform field; about any other point N = (p × E) + (r × F).
zh_cn: 对于一个理想化的无限小长度的偶极子，即使是非均匀电场，式（4.4）也给出了关于偶极子中心的力矩；而关于其他点，力矩为N=（p×E）+（r×F）。

source: Problem 4.5 In Fig. 4.6, p1 and p2 are (perfect) dipoles a distance r apart.
zh_cn: 习题4.5 在图4.6中，p1和p2为理想的偶极子，相距为r。

source: What is the torque on p1 due to p2?
zh_cn: p2导致p1的力矩为多少？

source: What is the torque on p2 due to p1?
zh_cn: p1导致p2的力矩为多少？

source: [In each case I want the torque on the dipole about its own center.
zh_cn: ［所求的力矩都是关于偶极子中心的。

source: If it bothers you that the answers are not equal and opposite, see Prob. 4.29.1.]
zh_cn: 如果你所得到的答案不是大小相等、方向相反的，可参见习题4.29。］

source: Problem 4.6
zh_cn: 习题4.6

source: A (perfect) dipole p is situated a distance z above an infinite grounded conducting plane (Fig. 4.7).
zh_cn: 一个理想偶极子p位于距一个无限大导体表面的z处（见图4.7）。

source: The dipole makes an angle . . . with the perpendicular to the plane.
zh_cn: 偶极子的方向与平面法线呈. . .角。

source: Find the torque on p.
zh_cn: 求作用在p上的力矩。

source: If the dipole is free to rotate, in what orientation will it come to rest?
zh_cn: 如果偶极子可自由旋转，那么当它静止后指向什么方向？

source: Problem 4.7
zh_cn: 习题4.7

source: Show that the energy of an ideal dipole p in an electric field E is given by . . . (4.6)
zh_cn: 证明理想偶极子p在电场E中的能量为. . .（4.6）

source: Problem 4.8
zh_cn: 习题4.8

source: Show that the interaction energy of two dipoles separated by a displacement r is . . . (4.7)
zh_cn: 证明相距为r的两个偶极子的相互作用能为. . .（4.7）

source: [Hint: use Prob. 4.7 and Eq. 3.104.1.]
zh_cn: ［提示：利用习题4.7和式（3.104）］

source: Problem 4.9
zh_cn: 习题4.9

source: A dipole p is a distance r from a point charge q, and oriented so that p makes an angle . . . with the vector r from q to p.
zh_cn: 一个偶极子p与一个点电荷q相距为r，p与r的夹角为. . .。

source: (a) What is the force on p?
zh_cn: （a）作用在p上的力为多少？

source: (b) What is the force on q?
zh_cn: （b）作用在q上的力为多少？

source: 4.1.4 Polarization
zh_cn: 4.1.4 极化强度

source: In the previous two sections we have considered the effect of an external electric field on an individual atom or molecule.
zh_cn: 在前两节中，我们考虑了外电场对单个原子或分子的影响。

source: We are now in a position to answer (qualitatively) the original question:
zh_cn: 现在我们可以来回答（定性地）最初的问题：

source: What happens to a piece of dielectric material when it is placed in an electric field?
zh_cn: 当一个电介质材料放入电场中会发生什么？

source: If the substance consists of neutral atoms (or nonpolar molecules), the field will induce in each a tiny dipole moment, pointing in the same direction as the field.
zh_cn: 如果材料由中性原子（或者非极化分子）组成，每一个原子或非极化分子都会被外场诱导出微小的偶极矩，其方向与外电场方向一致。

source: If the material is made up of polar molecules, each permanent dipole will experience a torque, tending to line it up along the field direction.
zh_cn: 如果材料由极化分子组成，每一个偶极矩都会受到一个力矩，驱使它们沿外电场方向排列。

source: (Random thermal motions compete with this process, so the alignment is never complete, especially at higher temperatures, and disappears almost at once when the field is removed.)
zh_cn: （随机的热运动会和这种过程竞争，因此极化分子的排列不是完全的，特别是在高温情况下，一旦外电场移除，极化将会立即完全消失）。

source: Notice that these two mechanisms produce the same basic result: a lot of little dipole., pointing along the direction of the field-the material becomes polarized.
zh_cn: 注意，这两个不同的机制产生同样的基本结果：许多小的偶极矩沿着外电场的方向——材料出现极化。

source: A convenient measure of this effect is. . .
zh_cn: 这个效应的一个通常量度是. . .

source: which is called the polarization.
zh_cn: 这被称做极化强度矢量。

source: From now on we shall not worry much about how the polarization got there.
zh_cn: 从现在起，我们将不再过多考虑极化是怎样产生的。

source: Actually, the two mechanisms I described are not as clear-cut as I tried to pretend.
zh_cn: 实际上，我所描述的两种机制并没有明显的界限。

source: Even in polar molecules there will be some polarization by displacement (though generally it is a lot easier to rotate a molecule than to stretch it, so the second mechanism dominates).
zh_cn: 即使在极化分子中也会有着某些位移极化（尽管，一般地，旋转一个极化分子比拉伸它要容易得多，因此第二个机制占优势）。

source: It's even possible in some materials to "freeze in" polarization, so that it persists after the field is removed.
zh_cn: 有些材料也可以“冻结”极化，当外电场撤除时，材料仍然保持极化。

source: But let's forget for a moment about the cause of the polarization and study the field that a chunk of polarized material itself produces.
zh_cn: 但是让我们先暂且忘却产生极化的原因，来研究材料极化自身产生的电场。

source: Then, in Sect.4.3, we will put it all together: the original field, which was responsible for P, plus the new field, which is due to P.
zh_cn: 然后，在4.3节中，我们将把它们结合起来：原电场，它诱导了P，再加上由P产生的新电场。
